
# 1. Вывести только те блюда, где цена выше 150 сом 
# 2. Найти самое дорогое блюдо
# 3. отсортировать блюда по цене (от дешевых к дорогим)
# 4. Проверить, есть ли хоть одно бдюдо, где категории -"десерт"

orders = [
    {"название": "Кофе", "цена": 120,"категорий": "напиток"},
    {"название": "Чай", "цена": 80,"категорий": "напиток"},
    {"название": "Пирог", "цена": 150,"категорий": "десерт"},
    {"название": "Салат", "цена": 200,"категорий": "оснавное"},
]

# 1
exp = list(filter(lambda x:x["цена"]>150,orders))
print(exp)
# 2
max_item = max (orders, key=lambda x: x ['цена'])
print(max_item)

#3
sorted_dishes = sorted(orders, key=lambda d: d["цена"])
print(sorted_dishes)

#4
dessert = any(map (lambda x:x ['категорий'].lower()=='десерт', orders))
print(dessert)