# 1. Показать все товары
# 2. Добавить новый товар
# 3. Найти товары по категории
# 4. Найти самый дорогой товар
# 5. Отфильтровать товары дешевле заданной цены
# 6. Поднять цену всем товарам на 5%
# 7. Выйти из программы

products = [
{"название": "Футболка", "цена": 800, "размер": "M", "категория": "мужская"},
{"название": "Платье", "цена": 1500, "размер": "L", "категория": "женская"},
{"название": "Куртка", "цена": 3500, "размер": "XL", "категория": "мужская"},
{"название": "Шорты", "цена": 1200, "размер": "S", "категория": "детская"},
{"название": "Джинсы", "цена": 2200, "размер": "L", "категория": "мужская"},
]



while True:
    print("""
1. Показать все товары
2. Добавить новый товар
3. Найти товары по категории
4. Найти самый дорогой товар
5. Отфильтровать товары дешевле заданной цены
6. Поднять цену всем товарам на 5%
7. Выйти из программы
""")

    choice = input("Выберите действие (1–7): ")

    if choice == "1":
        print(" Список всех товаров:")
        for item in products:
            print(item)

    elif choice == "2":
        name = input("Введите название товара: ")
        price = float(input("Введите цену: "))
        size = input("Введите размер: ")
        category = input("Введите категорию: ")
        products.append({"название": name, "цена": price, "размер": size, "категория": category})
        print("Товар добавлен!")

    elif choice == "3":
        cat = input("Введите категорию (мужская/женская/детская): ").lower()
        found = [p for p in products if p["категория"].lower() == cat]
        if found:
            print("Товары в категории", cat)
            for f in found:
                print(f)
        else:
            print(" Товары не найдены!")

    elif choice == "4":
        expensive = max(products, key=lambda x: x["цена"])
        print("Самый дорогой товар:", expensive)

    elif choice == "5":
        limit = float(input("Введите максимальную цену: "))
        filtered = list(filter(lambda x: x["цена"] < limit, products))
        if filtered:
            print(" Товары дешевле", limit, "сом:")
            for f in filtered:
                print(f)
        else:
            print("Таких товаров нет!")

    elif choice == "6":
        for p in products:
            p["цена"] *= 1.05  
        print(" Цены всех товаров увеличены на 5%!")

    elif choice == "7":
        print(" Выход из программы.")
        break

    else:
        print(" Ошибка: введите число от 1 до 7.")