def car_rental(cars, services):
        rental = []
        total = 0
        while True:
            name = input("имя:").lower()
            if name == "Стоп":
                print("Спасибо что арендовали")
                break
            passengers = int(input("Количество пассажиров:"))




















cars = {
    "Эконом": {"цена": 2000, "машины": 5, "макс_пассажиров": 4},
    "Комфорт": {"цена": 3500, "машины": 3, "макс_пассажиров": 5},
    "Бизнес": {"цена": 6000, "машины": 2, "макс_пассажиров": 5},
    "Внедорожник": {"цена": 8000, "машины": 2, "макс_пассажиров": 7}
}